if (App.data.locale === 'ua') {
    $.extend($.validator.messages, {
	required: "Це поле необхідно заповнити.", 
        remote: " Будь ласка, введіть правильне значення.", 
        email: " Будь ласка, введіть коректну адресу електронної пошти.", 
        url: " Будь ласка, введіть коректний URL.", 
        date: " Будь ласка, введіть коректну дату.", 
        dateISO: " Будь ласка, введіть коректну дату в форматі ISO.", 
        number: " Будь ласка, введіть число.", 
        digits: " Будь ласка, введіть лише цифри.", 
        creditcard: " Будь ласка, введіть правильний номер кредитної картки.", 
        equalTo: " Будь ласка, введіть таке ж значення ще раз.", 
        extension: " Будь ласка, виберіть файл з правильним розширенням.", 
        maxlength: $.validator.format("Будь ласка, введіть не більше {0} символів."), 
        minlength: $.validator.format("Будь ласка, введіть не менше {0} символів."), 
        rangelength: $.validator.format("Будь ласка, введіть значення довжиною від {0} до {1} символів."), 
        range: $.validator.format("Будь ласка, введіть число від {0} до {1}."), 
        max: $.validator.format("Будь ласка, введіть число, менше або рівне {0}."), 
        min: $.validator.format("Будь ласка, введіть число, яке дорівнює або перевищує {0}."), 
        remote_name: "Це ім'я вже зайнято.", 
        lettersonlyRuEn: "Дозволяється тільки літери."
    });
} else if (App.data.locale === 'ru') {
    $.extend($.validator.messages, {
	required: "Это поле необходимо заполнить.",
	remote: "Пожалуйста, введите правильное значение.",
	email: "Пожалуйста, введите корректный адрес электронной почты.",
	url: "Пожалуйста, введите корректный URL.",
	date: "Пожалуйста, введите корректную дату.",
	dateISO: "Пожалуйста, введите корректную дату в формате ISO.",
	number: "Пожалуйста, введите число.",
	digits: "Пожалуйста, вводите только цифры.",
	creditcard: "Пожалуйста, введите правильный номер кредитной карты.",
	equalTo: "Пожалуйста, введите такое же значение ещё раз.",
	extension: "Пожалуйста, выберите файл с правильным расширением.",
	maxlength: $.validator.format("Пожалуйста, введите не больше {0} символов."),
	minlength: $.validator.format("Пожалуйста, введите не меньше {0} символов."),
	rangelength: $.validator.format("Пожалуйста, введите значение длиной от {0} до {1} символов."),
	range: $.validator.format("Пожалуйста, введите число от {0} до {1}."),
	max: $.validator.format("Пожалуйста, введите число, меньшее или равное {0}."),
	min: $.validator.format("Пожалуйста, введите число, большее или равное {0}.")
});
}

